#CSV
- 쉼표로 데이터를 구분하고 줄바꿈으로 행을 바꾼다.

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('./Data/read_csv_sample.csv')
df1

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [3]:
df2 = pd.read_csv('./Data/read_csv_sample.csv', header=None)
df2

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

In [4]:
df3 = pd.read_csv('./Data/read_csv_sample.csv', index_col = None)
df3

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [5]:
df4 = pd.read_csv('./Data/read_csv_sample.csv', index_col='c0')
df4

    c1  c2  c3
c0
0    1   4   7
1    2   5   8
2    3   6   9

# Excel File

In [8]:
df1 = pd.read_excel("./Data/남북한발전전력량.xlsx", engine = "openpyxl")
df1

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
1,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
3,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
4,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
5,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
6,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
7,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
8,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

# JSON file

In [10]:
df1 = pd.read_json('./Data/read_json_sample.json')
df1

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

# HTML file

In [12]:
table = pd.read_html('./Data/sample.html')
table

[   Unnamed: 0  c0  c1  c2  c3
 0           0   0   1   4   7
 1           1   1   2   5   8
 2           2   2   3   6   9,
          name  year        developer  opensource
 0       NumPy  2006  Travis Oliphant        True
 1  matplotlib  2003   John D. Hunter        True
 2      pandas  2008    Wes Mckinneye        True]

In [13]:
# table 갯수 확인 
len(table)

2

In [14]:
# table list 원소를 iteration하면서 각각 화면 출력 
for i in range(len(table)):
    print("table[%s]"%i)
    print(table[i])
    print("")

table[0]
   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9

table[1]
         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [15]:
# 파이썬 패키지 정보가 들어 있는 두번째 데이터 프레임을 선택하여 df 변수에 저장 
df = table[1]
df

         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [25]:
# name열을 index로 지정 
df.set_index(['name'], inplace = True)

KeyError: "None of ['name'] are in the columns"

In [26]:
df

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

# API 활용하여 데이터 수집하기 
## Google Geocoding 
 - 장소, 이름 또는 주소 입력하면 위도와 경도 좌표 정보를 변환해주는 서비스
 - API 키를 발급 받아 사용 가능하며, 등록시 신용카드 정보가 필요하며 무료 사용량 초과하면 요금을 지불해야하는 상황이 발생 

## Google Geocoding 발급 절차 
 - https://cloud.google.com/maps-platform/places/?hl=ko
 - 새 프로젝트 만들기(무료 평가판 사용 가능하지만 신용카드 정보 등록 필요) 
 - API 설정 
 - 사용자 인증 
 - API KEY 발급

In [27]:
!pip install googlemaps

Collecting googlemaps
  Downloading googlemaps-4.5.3.tar.gz (32 kB)
Requirement already satisfied: requests<3.0,>=2.20.0 in /Users/jungjooyoung/opt/anaconda3/lib/python3.8/site-packages (from googlemaps) (2.25.1)
Requirement already satisfied: chardet<5,>=3.0.2 in /Users/jungjooyoung/opt/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (4.0.0)
Requirement already satisfied: idna<3,>=2.5 in /Users/jungjooyoung/opt/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (2.10)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /Users/jungjooyoung/opt/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (1.26.4)
Requirement already satisfied: certifi>=2017.4.17 in /Users/jungjooyoung/opt/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (2020.12.5)
Building wheels for collected packages: googlemaps
  Building wheel for googlemaps (setup.py) ... done
  Created wheel for googlemaps: filename=googlemaps-4.5.3-py3-none-any.whl size=38459 sha256=0e5662a9fddafd660697b11fc65d2fdfc98415b9ebd894cb19f64f1283f471a2
  Stored in directory: /Users/jungjooyoung/Library/Caches/pip/wheels/f7/54/d6/ec34a2c6e62e4a8dace614a9a617bff39b7cccfb337cc36c98
Successfully built googlemaps
Installing collected packages: googlemaps
Successfully installed googlemaps-4.5.3

In [29]:
my_key ="AIzaSyALmXZZNjkoJwGI63Uw-HiphRHSC9bY3hc"
import googlemaps
maps = googlemaps.Client(key=my_key)
lat =[]
lng =[]

In [33]:
places = ['서울시청','국립국악원','해운대해수욕장']

In [32]:
maps.geocode('서울시청')[0].get('geometry')

{'location': {'lat': 37.5662952, 'lng': 126.9779451},
 'location_type': 'ROOFTOP',
 'viewport': {'northeast': {'lat': 37.5676441802915, 'lng': 126.9792940802915},
  'southwest': {'lat': 37.5649462197085, 'lng': 126.9765961197085}}}

In [34]:
i = 0
for place in places:
    i+=1
    try:
        print(i,place)
        geo_location = maps.geocode(place)[0].get('geometry')
        lat.append(geo_location['location']['lat'])
        lng.append(geo_location['location']['lng'])
    except:
        lat.append('')
        lng.append('')
        print(i)

1 서울시청
2 국립국악원
3 해운대해수욕장

In [35]:
df = pd.DataFrame({'위도':lat, '경도':lng}, index=places)
df

                위도          경도
서울시청     37.566295  126.977945
국립국악원    37.477759  127.008304
해운대해수욕장  35.158698  129.160384

---- 
# 데이터 저장하기

### CSV File

In [36]:
data ={
        'name':['Jerry','Riah','Paul'],
        'algol':['A','A+','B'],
        'basic':['C','B','B+'],
        'C++':['B+','B','C']
      }
data

{'name': ['Jerry', 'Riah', 'Paul'],
 'algol': ['A', 'A+', 'B'],
 'basic': ['C', 'B', 'B+'],
 'C++': ['B+', 'B', 'C']}

In [37]:
df = pd.DataFrame(data)
df.set_index('name', inplace=True)
df

      algol basic C++
name
Jerry     A     C  B+
Riah     A+     B   B
Paul      B    B+   C

In [38]:
df.to_csv("./Data/df_sample.csv")

In [39]:
df.to_json("./Data/df_sample.json")

In [40]:
df.to_excel("./Data/df_sample.xlsx")

In [41]:
data2 ={
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}
data2

{'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [42]:
df2 = pd.DataFrame(data2)
df2.set_index("A", inplace=True)
df2

   B  C
A
1  4  7
2  5  8
3  6  9

In [44]:
# 엑셀의 각각 다른 sheet로 Data 넣기 
writer = pd.ExcelWriter("./Data/df_excelwriter.xlsx")
df.to_excel(writer, sheet_name = "sheet1")
df2.to_excel(writer, sheet_name="sheet2")
writer.save()

In [ ]:
# pandas의 내장 그래픽 도구